{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# GI50\n",
    "This NCI60 data gives an insight to effect of a chemical on cancer.\n",
    "Cancer is not one disease but a collection of every possible cell in your body growing uncontrolled.\n",
    "For this reason NCI60 has multiple different cell lines (column CELL_NAME).\n",
    "\n",
    "I have here the GI50 data of the NCI60 project\n",
    "GI50: concentration to stop growth with 50%. column \"AVERAGE\" is the average concentration needed."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "from os.path import join as path_join\n",
    "import numpy as np\n",
    "import json"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(4585048, 14)\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>RELEASE_DATE</th>\n",
       "      <th>EXPID</th>\n",
       "      <th>PREFIX</th>\n",
       "      <th>NSC</th>\n",
       "      <th>CONCENTRATION_UNIT</th>\n",
       "      <th>LOG_HI_CONCENTRATION</th>\n",
       "      <th>PANEL_NUMBER</th>\n",
       "      <th>CELL_NUMBER</th>\n",
       "      <th>PANEL_NAME</th>\n",
       "      <th>CELL_NAME</th>\n",
       "      <th>PANEL_CODE</th>\n",
       "      <th>COUNT</th>\n",
       "      <th>AVERAGE</th>\n",
       "      <th>STDDEV</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>20210223</td>\n",
       "      <td>0001MD02</td>\n",
       "      <td>S</td>\n",
       "      <td>123127</td>\n",
       "      <td>M</td>\n",
       "      <td>-4.6021</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>Non-Small Cell Lung Cancer</td>\n",
       "      <td>NCI-H23</td>\n",
       "      <td>LNS</td>\n",
       "      <td>1</td>\n",
       "      <td>-7.1391</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>20210223</td>\n",
       "      <td>0001MD02</td>\n",
       "      <td>S</td>\n",
       "      <td>123127</td>\n",
       "      <td>M</td>\n",
       "      <td>-4.6021</td>\n",
       "      <td>10</td>\n",
       "      <td>14</td>\n",
       "      <td>Melanoma</td>\n",
       "      <td>M14</td>\n",
       "      <td>MEL</td>\n",
       "      <td>1</td>\n",
       "      <td>-7.0520</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>20210223</td>\n",
       "      <td>0001MD02</td>\n",
       "      <td>S</td>\n",
       "      <td>123127</td>\n",
       "      <td>M</td>\n",
       "      <td>-4.6021</td>\n",
       "      <td>12</td>\n",
       "      <td>5</td>\n",
       "      <td>CNS Cancer</td>\n",
       "      <td>SNB-75</td>\n",
       "      <td>CNS</td>\n",
       "      <td>1</td>\n",
       "      <td>-7.1380</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>20210223</td>\n",
       "      <td>0001MD02</td>\n",
       "      <td>S</td>\n",
       "      <td>123127</td>\n",
       "      <td>M</td>\n",
       "      <td>-4.6021</td>\n",
       "      <td>4</td>\n",
       "      <td>2</td>\n",
       "      <td>Colon Cancer</td>\n",
       "      <td>HCC-2998</td>\n",
       "      <td>COL</td>\n",
       "      <td>1</td>\n",
       "      <td>-6.9426</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>20210223</td>\n",
       "      <td>0001MD02</td>\n",
       "      <td>S</td>\n",
       "      <td>123127</td>\n",
       "      <td>M</td>\n",
       "      <td>-4.6021</td>\n",
       "      <td>5</td>\n",
       "      <td>5</td>\n",
       "      <td>Breast Cancer</td>\n",
       "      <td>MDA-MB-231/ATCC</td>\n",
       "      <td>BRE</td>\n",
       "      <td>1</td>\n",
       "      <td>-6.4485</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   RELEASE_DATE     EXPID PREFIX     NSC CONCENTRATION_UNIT  \\\n",
       "0      20210223  0001MD02      S  123127                  M   \n",
       "1      20210223  0001MD02      S  123127                  M   \n",
       "2      20210223  0001MD02      S  123127                  M   \n",
       "3      20210223  0001MD02      S  123127                  M   \n",
       "4      20210223  0001MD02      S  123127                  M   \n",
       "\n",
       "   LOG_HI_CONCENTRATION  PANEL_NUMBER  CELL_NUMBER  \\\n",
       "0               -4.6021             1            1   \n",
       "1               -4.6021            10           14   \n",
       "2               -4.6021            12            5   \n",
       "3               -4.6021             4            2   \n",
       "4               -4.6021             5            5   \n",
       "\n",
       "                   PANEL_NAME        CELL_NAME PANEL_CODE  COUNT  AVERAGE  \\\n",
       "0  Non-Small Cell Lung Cancer          NCI-H23        LNS      1  -7.1391   \n",
       "1                    Melanoma              M14        MEL      1  -7.0520   \n",
       "2                  CNS Cancer           SNB-75        CNS      1  -7.1380   \n",
       "3                Colon Cancer         HCC-2998        COL      1  -6.9426   \n",
       "4               Breast Cancer  MDA-MB-231/ATCC        BRE      1  -6.4485   \n",
       "\n",
       "   STDDEV  \n",
       "0     0.0  \n",
       "1     0.0  \n",
       "2     0.0  \n",
       "3     0.0  \n",
       "4     0.0  "
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "gi50 = pd.read_csv(path_join(\"data\", \"GI50.csv\"))\n",
    "print(gi50.shape)\n",
    "gi50.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "import json\n",
    "\n",
    "from py2neo import Graph\n",
    "\n",
    "with open(\"config.json\") as f:\n",
    "    config = json.load(f)\n",
    "\n",
    "neo4j_url = config.get(\"neo4jUrl\", \"bolt://localhost:7687\")\n",
    "user = config.get(\"user\", \"neo4j\")\n",
    "pswd = config.get(\"pswd\", \"password\")\n",
    "graph = Graph(neo4j_url, auth=(user, pswd))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [],
   "source": [
    "with open(\"cellline_nci60_to_chembl.json\", \"r\") as fp:\n",
    "    cell_lines_json = json.load(fp)\n",
    "\n",
    "cell_lines = [i for i in cell_lines_json if cell_lines_json[i]]"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Creating a pivot table. Where every value is the average GI50 value of the combination cell line (row) and chemical (column)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th>NSC</th>\n",
       "      <th>1</th>\n",
       "      <th>17</th>\n",
       "      <th>26</th>\n",
       "      <th>89</th>\n",
       "      <th>112</th>\n",
       "      <th>171</th>\n",
       "      <th>185</th>\n",
       "      <th>186</th>\n",
       "      <th>196</th>\n",
       "      <th>197</th>\n",
       "      <th>...</th>\n",
       "      <th>836824</th>\n",
       "      <th>836941</th>\n",
       "      <th>836942</th>\n",
       "      <th>837081</th>\n",
       "      <th>837082</th>\n",
       "      <th>837396</th>\n",
       "      <th>837397</th>\n",
       "      <th>837398</th>\n",
       "      <th>837892</th>\n",
       "      <th>837893</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>CELL_NAME</th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>786-0</th>\n",
       "      <td>-4.716867</td>\n",
       "      <td>-5.557233</td>\n",
       "      <td>-5.4265</td>\n",
       "      <td>-4.700050</td>\n",
       "      <td>-6.4911</td>\n",
       "      <td>-4.0</td>\n",
       "      <td>-7.4287</td>\n",
       "      <td>-4.609967</td>\n",
       "      <td>-5.1022</td>\n",
       "      <td>-5.5461</td>\n",
       "      <td>...</td>\n",
       "      <td>-5.4324</td>\n",
       "      <td>-5.3468</td>\n",
       "      <td>-4.0</td>\n",
       "      <td>-4.8286</td>\n",
       "      <td>-5.1042</td>\n",
       "      <td>-6.69690</td>\n",
       "      <td>-5.5047</td>\n",
       "      <td>-6.56690</td>\n",
       "      <td>-4.301</td>\n",
       "      <td>-5.6072</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>A-172/H.Fine</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>-4.230500</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>A-204</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>A431</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>A498</th>\n",
       "      <td>-4.363500</td>\n",
       "      <td>-4.664067</td>\n",
       "      <td>NaN</td>\n",
       "      <td>-4.144533</td>\n",
       "      <td>-6.1375</td>\n",
       "      <td>-4.0</td>\n",
       "      <td>NaN</td>\n",
       "      <td>-5.458580</td>\n",
       "      <td>-4.9329</td>\n",
       "      <td>-4.8278</td>\n",
       "      <td>...</td>\n",
       "      <td>-5.3284</td>\n",
       "      <td>-4.0000</td>\n",
       "      <td>-4.0</td>\n",
       "      <td>-4.8123</td>\n",
       "      <td>-4.8738</td>\n",
       "      <td>-5.75485</td>\n",
       "      <td>-5.4407</td>\n",
       "      <td>-6.79295</td>\n",
       "      <td>-4.301</td>\n",
       "      <td>-5.6273</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>5 rows × 56685 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "NSC             1         17      26        89      112     171     185     \\\n",
       "CELL_NAME                                                                    \n",
       "786-0        -4.716867 -5.557233 -5.4265 -4.700050 -6.4911    -4.0 -7.4287   \n",
       "A-172/H.Fine       NaN       NaN     NaN       NaN     NaN     NaN     NaN   \n",
       "A-204              NaN       NaN     NaN       NaN     NaN     NaN     NaN   \n",
       "A431               NaN       NaN     NaN       NaN     NaN     NaN     NaN   \n",
       "A498         -4.363500 -4.664067     NaN -4.144533 -6.1375    -4.0     NaN   \n",
       "\n",
       "NSC             186     196     197     ...  836824  836941  836942  837081  \\\n",
       "CELL_NAME                               ...                                   \n",
       "786-0        -4.609967 -5.1022 -5.5461  ... -5.4324 -5.3468    -4.0 -4.8286   \n",
       "A-172/H.Fine -4.230500     NaN     NaN  ...     NaN     NaN     NaN     NaN   \n",
       "A-204              NaN     NaN     NaN  ...     NaN     NaN     NaN     NaN   \n",
       "A431               NaN     NaN     NaN  ...     NaN     NaN     NaN     NaN   \n",
       "A498         -5.458580 -4.9329 -4.8278  ... -5.3284 -4.0000    -4.0 -4.8123   \n",
       "\n",
       "NSC           837082   837396  837397   837398  837892  837893  \n",
       "CELL_NAME                                                       \n",
       "786-0        -5.1042 -6.69690 -5.5047 -6.56690  -4.301 -5.6072  \n",
       "A-172/H.Fine     NaN      NaN     NaN      NaN     NaN     NaN  \n",
       "A-204            NaN      NaN     NaN      NaN     NaN     NaN  \n",
       "A431             NaN      NaN     NaN      NaN     NaN     NaN  \n",
       "A498         -4.8738 -5.75485 -5.4407 -6.79295  -4.301 -5.6273  \n",
       "\n",
       "[5 rows x 56685 columns]"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Select only the rows that are in the database\n",
    "correlation = pd.pivot_table(gi50.loc[gi50[\"CELL_NAME\"].isin(cell_lines)], values='AVERAGE', index=['CELL_NAME'],\n",
    "                    columns=['NSC'], aggfunc=np.mean)\n",
    "correlation.head()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "The difference in how 2 cell lines react to the same chemical gives us an idea how similar those 2 cell lines are. If we take the average of all difference between all chemicals they have in common we get a difference score. Where 0 means the cells are the same, and infinite means they could not be more different."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Avg diff 0.5365136610125857, num difs 59\n"
     ]
    }
   ],
   "source": [
    "all_diffs_pd = np.abs(correlation[19893] - correlation[713724])\n",
    "print(f\"Avg diff {all_diffs_pd.loc[all_diffs_pd.notna()].mean()}, num difs {sum(all_diffs_pd.notna())}\")\n",
    "all_diffs_pd = all_diffs_pd.loc[all_diffs_pd.notna()].to_dict()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "We can do the same in a graph database. However the database is not fully in memory. So first we need to retrieve the data from the corresponding cells"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'786-0': 0.07140702732849302, 'A498': 0.4297192862045325, 'A549': 1.5849812256267448, 'ACHN': 0.4607676683361186, 'BT-549': 0.3980160843770584, 'CAKI-1': 0.7842997108154997, 'CCRF-CEM': 0.17629994022713547, 'COLO 205': 0.5759622546270435, 'DU-145': 0.4109427840909019, 'EKVX ': 0.5392973776223808, 'HCC 2998': 1.0807086896551752, 'HCT-116': 0.8050908890115922, 'HCT-15': 1.1062023730684443, 'HL-60(TB)': 0.39653701765860916, 'HOP-62': 0.4174759237875314, 'HOP-92': 0.19887397355601966, 'HT-29': 0.9304206349206288, 'Hs-578T': 0.34562432432433, 'IGROV-1': 0.8508854774156802, 'K562': 0.2886813805104502, 'KM12': 0.35321072818232757, 'LOX IMVI ': 0.8849687536571071, 'M14': 0.006811386696730537, 'MCF7': 0.9765160388127683, 'MDA-MB-231': 1.1169995480225974, 'MDA-MB-435': 0.4913412057522084, 'MDA-N': 0.492866342412448, 'MOLT-4': 0.43246514546491355, 'Malme-3M': 0.30963925294887495, 'NCI-H226': 0.6340676885346457, 'NCI-H23': 0.8848983164983046, 'NCI-H322M': 0.5771718475073238, 'NCI-H460': 1.4743202214452262, 'NCI-H522': 0.4307893695920866, 'NCI/ADR-RES': 0.10697089887641287, 'OVCAR-3': 0.322021609195402, 'OVCAR-4': 0.14252493932039556, 'OVCAR-5': 0.23215921198668088, 'OVCAR-8': 0.6809517067711335, 'PC-3': 0.32066888131742743, 'RPMI-8226': 0.38624521472393436, 'RXF 393': 0.0876878334417821, 'SF-268': 0.17640068259386243, 'SF-295': 0.11384274509802239, 'SF-539': 1.2926568567961096, 'SK-MEL-2': 1.4502196149217847, 'SK-MEL-28': 0.3229562026790962, 'SK-MEL-5': 0.5059871485943885, 'SK-OV-3': 0.2345530091185406, 'SN12C': 0.2375217718587077, 'SNB-19': 0.056713890457365856, 'SNB-75': 0.3031774983881381, 'SW-620': 0.5627129660545291, 'T47D': 0.5140941646191672, 'TK-10': 0.7629168938944884, 'U-251': 0.075829794330188, 'UACC-257': 0.49363090596330483, 'UACC-62': 0.5143148837209353, 'UO-31': 0.8394460578559366}\n"
     ]
    }
   ],
   "source": [
    "response = graph.run(\n",
    "    \"\"\"\n",
    "    MATCH (org_chem:Synonym {pubChemSynId: \"176dde90cc9dd83eed129de11b203b03\"})\n",
    "    MATCH (gi50:Measurement {name: \"GI50\"})\n",
    "\n",
    "    MATCH (cell:CellLine)<-[:USES]-(c:Condition)-[:USES]->(org_chem)\n",
    "    MATCH (c)-[m:MEASURES]->(gi50)\n",
    "    WITH DISTINCT cell, avg(toFloat(m.value)) as values1, org_chem, gi50\n",
    "\n",
    "    CALL {\n",
    "        WITH cell, gi50, values1\n",
    "        MATCH (chem:Synonym)\n",
    "        WHERE chem.pubChemSynId IN [\"1d75798754df81c782e805287ff7ef83\"] //, \"ecb8cd2425f4430ce611e50153f09dcc\"]\n",
    "        MATCH (cell)<-[:USES]-(c:Condition)-[:USES]->(chem)\n",
    "        MATCH (c)-[m2:MEASURES]->(gi50)\n",
    "        RETURN DISTINCT cell as cell2, abs(toFloat(m2.value) - values1) as distance,  chem\n",
    "    }\n",
    "\n",
    "    RETURN DISTINCT chem.name, cell2.label as cell_name, avg(distance) as dist, count(distance)\n",
    "    ORDER BY cell_name\n",
    "    \"\"\"\n",
    ").data()\n",
    "\n",
    "all_diffs_neo = {}\n",
    "for r in response:\n",
    "    all_diffs_neo[r[\"cell_name\"]] = r[\"dist\"]\n",
    "print(all_diffs_neo)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "At this point in the database only hold GI50 data, but we still write the query like more kinds of data exists. We look for all chemicals that have both a condition with cell A and cell B. All conditions also most have GI50 measurement.\n",
    "Next up we average the measurements and calculate the distance just like above.\n",
    "The values do differ a bit from each other because not all chemicals could be loaded into the database."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'cell_name': 'HCT-15', 'value1': -5.243602373068445, 'num_values': 1812, 'chem_name': 'nsc19893'}\n",
      "{'cell_name': 'HCT-116', 'value1': -5.386090889011593, 'num_values': 1811, 'chem_name': 'nsc19893'}\n",
      "{'cell_name': 'MDA-MB-435', 'value1': -5.0008412057522085, 'num_values': 1808, 'chem_name': 'nsc19893'}\n",
      "{'cell_name': 'OVCAR-5', 'value1': -3.767840788013319, 'num_values': 1802, 'chem_name': 'nsc19893'}\n",
      "{'cell_name': 'U-251', 'value1': -4.355170205669812, 'num_values': 1799, 'chem_name': 'nsc19893'}\n",
      "{'cell_name': 'KM12', 'value1': -5.044110728182328, 'num_values': 1799, 'chem_name': 'nsc19893'}\n",
      "{'cell_name': 'ACHN', 'value1': -5.016267668336119, 'num_values': 1797, 'chem_name': 'nsc19893'}\n",
      "{'cell_name': 'SW-620', 'value1': -4.562712966054529, 'num_values': 1797, 'chem_name': 'nsc19893'}\n",
      "{'cell_name': 'A549', 'value1': -5.680181225626745, 'num_values': 1795, 'chem_name': 'nsc19893'}\n",
      "{'cell_name': '786-0', 'value1': -4.915207027328493, 'num_values': 1793, 'chem_name': 'nsc19893'}\n",
      "{'cell_name': 'OVCAR-8', 'value1': -4.698651706771133, 'num_values': 1787, 'chem_name': 'nsc19893'}\n",
      "{'cell_name': 'SF-295', 'value1': -4.303157254901977, 'num_values': 1785, 'chem_name': 'nsc19893'}\n",
      "{'cell_name': 'COLO 205', 'value1': -5.170562254627043, 'num_values': 1783, 'chem_name': 'nsc19893'}\n",
      "{'cell_name': 'NCI-H23', 'value1': -4.914398316498304, 'num_values': 1782, 'chem_name': 'nsc19893'}\n",
      "{'cell_name': 'NCI/ADR-RES', 'value1': -4.3841708988764125, 'num_values': 1780, 'chem_name': 'nsc19893'}\n",
      "{'cell_name': 'M14', 'value1': -4.35031138669673, 'num_values': 1774, 'chem_name': 'nsc19893'}\n",
      "{'cell_name': 'SNB-19', 'value1': -3.943286109542634, 'num_values': 1771, 'chem_name': 'nsc19893'}\n",
      "{'cell_name': 'MDA-MB-231', 'value1': -3.3126004519774024, 'num_values': 1770, 'chem_name': 'nsc19893'}\n",
      "{'cell_name': 'HT-29', 'value1': -5.177520634920628, 'num_values': 1764, 'chem_name': 'nsc19893'}\n",
      "{'cell_name': 'UO-31', 'value1': -5.253846057855936, 'num_values': 1763, 'chem_name': 'nsc19893'}\n",
      "{'cell_name': 'PC-3', 'value1': -4.3085311186825725, 'num_values': 1761, 'chem_name': 'nsc19893'}\n",
      "{'cell_name': 'DU-145', 'value1': -5.032142784090902, 'num_values': 1760, 'chem_name': 'nsc19893'}\n",
      "{'cell_name': 'SF-268', 'value1': -4.304500682593862, 'num_values': 1758, 'chem_name': 'nsc19893'}\n",
      "{'cell_name': 'MOLT-4', 'value1': -4.868965145464913, 'num_values': 1753, 'chem_name': 'nsc19893'}\n",
      "{'cell_name': 'MCF7', 'value1': -5.749916038812768, 'num_values': 1752, 'chem_name': 'nsc19893'}\n",
      "{'cell_name': 'IGROV-1', 'value1': -4.85088547741568, 'num_values': 1749, 'chem_name': 'nsc19893'}\n",
      "{'cell_name': 'UACC-257', 'value1': -4.046169094036695, 'num_values': 1744, 'chem_name': 'nsc19893'}\n",
      "{'cell_name': 'SK-MEL-5', 'value1': -4.946987148594388, 'num_values': 1743, 'chem_name': 'nsc19893'}\n",
      "{'cell_name': 'OVCAR-3', 'value1': -4.603521609195402, 'num_values': 1740, 'chem_name': 'nsc19893'}\n",
      "{'cell_name': 'HOP-62', 'value1': -4.668275923787531, 'num_values': 1732, 'chem_name': 'nsc19893'}\n",
      "{'cell_name': 'CAKI-1', 'value1': -5.334399710815499, 'num_values': 1729, 'chem_name': 'nsc19893'}\n",
      "{'cell_name': 'SN12C', 'value1': -4.613321771858708, 'num_values': 1727, 'chem_name': 'nsc19893'}\n",
      "{'cell_name': 'K562', 'value1': -4.686381380510451, 'num_values': 1724, 'chem_name': 'nsc19893'}\n",
      "{'cell_name': 'UACC-62', 'value1': -4.857514883720936, 'num_values': 1720, 'chem_name': 'nsc19893'}\n",
      "{'cell_name': 'SK-MEL-28', 'value1': -4.322956202679096, 'num_values': 1717, 'chem_name': 'nsc19893'}\n",
      "{'cell_name': 'EKVX ', 'value1': -3.529702622377619, 'num_values': 1716, 'chem_name': 'nsc19893'}\n",
      "{'cell_name': 'NCI-H460', 'value1': -5.977920221445226, 'num_values': 1716, 'chem_name': 'nsc19893'}\n",
      "{'cell_name': 'LOX IMVI ', 'value1': -5.223568753657107, 'num_values': 1709, 'chem_name': 'nsc19893'}\n",
      "{'cell_name': 'NCI-H322M', 'value1': -4.677771847507324, 'num_values': 1705, 'chem_name': 'nsc19893'}\n",
      "{'cell_name': 'TK-10', 'value1': -3.8772831061055117, 'num_values': 1687, 'chem_name': 'nsc19893'}\n",
      "{'cell_name': 'CCRF-CEM', 'value1': -4.476399940227135, 'num_values': 1673, 'chem_name': 'nsc19893'}\n",
      "{'cell_name': 'SK-MEL-2', 'value1': -3.425680385078215, 'num_values': 1662, 'chem_name': 'nsc19893'}\n",
      "{'cell_name': 'SF-539', 'value1': -5.88325685679611, 'num_values': 1648, 'chem_name': 'nsc19893'}\n",
      "{'cell_name': 'OVCAR-4', 'value1': -4.141875060679604, 'num_values': 1648, 'chem_name': 'nsc19893'}\n",
      "{'cell_name': 'SK-OV-3', 'value1': -3.7654469908814594, 'num_values': 1645, 'chem_name': 'nsc19893'}\n",
      "{'cell_name': 'NCI-H226', 'value1': -3.5967323114653547, 'num_values': 1631, 'chem_name': 'nsc19893'}\n",
      "{'cell_name': 'RPMI-8226', 'value1': -5.317045214723934, 'num_values': 1630, 'chem_name': 'nsc19893'}\n",
      "{'cell_name': 'T47D', 'value1': -4.1312058353808325, 'num_values': 1628, 'chem_name': 'nsc19893'}\n",
      "{'cell_name': 'Hs-578T', 'value1': -3.65437567567567, 'num_values': 1628, 'chem_name': 'nsc19893'}\n",
      "{'cell_name': 'NCI-H522', 'value1': -4.430789369592087, 'num_values': 1618, 'chem_name': 'nsc19893'}\n",
      "{'cell_name': 'SNB-75', 'value1': -3.742822501611862, 'num_values': 1551, 'chem_name': 'nsc19893'}\n",
      "{'cell_name': 'MDA-N', 'value1': -5.092366342412448, 'num_values': 1542, 'chem_name': 'nsc19893'}\n",
      "{'cell_name': 'RXF 393', 'value1': -4.290012166558218, 'num_values': 1537, 'chem_name': 'nsc19893'}\n",
      "{'cell_name': 'SR', 'value1': -5.380112972620605, 'num_values': 1534, 'chem_name': 'nsc19893'}\n",
      "{'cell_name': 'HL-60(TB)', 'value1': -4.683637017658609, 'num_values': 1529, 'chem_name': 'nsc19893'}\n",
      "{'cell_name': 'Malme-3M', 'value1': -4.672539252948875, 'num_values': 1526, 'chem_name': 'nsc19893'}\n",
      "{'cell_name': 'BT-549', 'value1': -3.9776839156229418, 'num_values': 1517, 'chem_name': 'nsc19893'}\n",
      "{'cell_name': 'A498', 'value1': -4.9720192862045325, 'num_values': 1457, 'chem_name': 'nsc19893'}\n",
      "{'cell_name': 'HCC 2998', 'value1': -5.811708689655175, 'num_values': 1450, 'chem_name': 'nsc19893'}\n",
      "{'cell_name': 'HOP-92', 'value1': -3.8011260264439803, 'num_values': 1437, 'chem_name': 'nsc19893'}\n",
      "{'cell_name': 'MDA-MB-468', 'value1': -4.4842, 'num_values': 9, 'chem_name': 'nsc19893'}\n",
      "{'cell_name': 'MAXF401 cell line', 'value1': -4.107714285714286, 'num_values': 7, 'chem_name': 'nsc19893'}\n",
      "{'cell_name': 'SK-BR-3', 'value1': -5.7594142857142865, 'num_values': 7, 'chem_name': 'nsc19893'}\n",
      "{'cell_name': 'WI-38', 'value1': -3.3321, 'num_values': 2, 'chem_name': 'nsc19893'}\n",
      "{'cell_name': 'MDA-MB-435S', 'value1': -4.0005, 'num_values': 1, 'chem_name': 'nsc19893'}\n",
      "{'cell_name': 'MAR BEL fibroblasts cell line', 'value1': -3.4636, 'num_values': 1, 'chem_name': 'nsc19893'}\n",
      "{'cell_name': 'CCD 19Lu', 'value1': -4.3987, 'num_values': 1, 'chem_name': 'nsc19893'}\n",
      "{'cell_name': 'A-431', 'value1': -6.6021, 'num_values': 1, 'chem_name': 'nsc19893'}\n",
      "{'cell_name': 'LN-229', 'value1': -3.6542, 'num_values': 1, 'chem_name': 'nsc19893'}\n",
      "{'cell_name': 'U373', 'value1': -4.0663, 'num_values': 1, 'chem_name': 'nsc19893'}\n",
      "{'cell_name': 'U-118-MG', 'value1': -3.7068, 'num_values': 1, 'chem_name': 'nsc19893'}\n",
      "{'cell_name': 'T98G', 'value1': -3.7354, 'num_values': 1, 'chem_name': 'nsc19893'}\n",
      "{'cell_name': 'A 172', 'value1': -5.0341, 'num_values': 1, 'chem_name': 'nsc19893'}\n",
      "{'cell_name': 'U87', 'value1': -5.5868, 'num_values': 1, 'chem_name': 'nsc19893'}\n"
     ]
    }
   ],
   "source": [
    "response = graph.run(\n",
    "    \"\"\"\n",
    "    MATCH (org_chem:Synonym {pubChemSynId: \"176dde90cc9dd83eed129de11b203b03\"})\n",
    "    MATCH (gi50:Measurement {name: \"GI50\"})\n",
    "\n",
    "    MATCH (cell:CellLine)<-[:USES]-(c:Condition)-[:USES]->(org_chem)\n",
    "    MATCH (c)-[m:MEASURES]->(gi50)\n",
    "\n",
    "    WITH DISTINCT cell, avg(toFloat(m.value)) as value1, count(m) as num_values, org_chem\n",
    "    RETURN cell.label as cell_name, value1, num_values, org_chem.name as chem_name\n",
    "    ORDER BY num_values DESC\n",
    "    \"\"\"\n",
    ").data()\n",
    "for r in response:\n",
    "    print(r)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'chem.name': 'nsc-361605', 'cell_name': '786-0', 'avg(distance)': 0.2453070273284932, 'count(distance)': 2}\n",
      "{'chem.name': 'nsc-361605', 'cell_name': 'A498', 'avg(distance)': 0.9720192862045325, 'count(distance)': 1}\n",
      "{'chem.name': 'nsc-361605', 'cell_name': 'A549', 'avg(distance)': 0.320981225626745, 'count(distance)': 2}\n",
      "{'chem.name': 'nsc-361605', 'cell_name': 'ACHN', 'avg(distance)': 0.08511766833611878, 'count(distance)': 2}\n",
      "{'chem.name': 'nsc-361605', 'cell_name': 'CAKI-1', 'avg(distance)': 0.7124997108154991, 'count(distance)': 1}\n",
      "{'chem.name': 'nsc-361605', 'cell_name': 'CCRF-CEM', 'avg(distance)': 0.2640000597728651, 'count(distance)': 2}\n",
      "{'chem.name': 'nsc-361605', 'cell_name': 'COLO 205', 'avg(distance)': 0.49361225462704317, 'count(distance)': 2}\n",
      "{'chem.name': 'nsc-361605', 'cell_name': 'EKVX ', 'avg(distance)': 1.5574973776223806, 'count(distance)': 2}\n",
      "{'chem.name': 'nsc-361605', 'cell_name': 'HCC 2998', 'avg(distance)': 0.3087913103448252, 'count(distance)': 2}\n",
      "{'chem.name': 'nsc-361605', 'cell_name': 'HCT-116', 'avg(distance)': 0.14914088901159284, 'count(distance)': 2}\n",
      "{'chem.name': 'nsc-361605', 'cell_name': 'HCT-15', 'avg(distance)': 0.2186523730684451, 'count(distance)': 2}\n",
      "{'chem.name': 'nsc-361605', 'cell_name': 'HL-60(TB)', 'avg(distance)': 0.3298129823413909, 'count(distance)': 2}\n",
      "{'chem.name': 'nsc-361605', 'cell_name': 'HOP-62', 'avg(distance)': 0.6972500000000004, 'count(distance)': 2}\n",
      "{'chem.name': 'nsc-361605', 'cell_name': 'HT-29', 'avg(distance)': 0.10529999999999973, 'count(distance)': 2}\n",
      "{'chem.name': 'nsc-361605', 'cell_name': 'IGROV-1', 'avg(distance)': 0.8354354774156802, 'count(distance)': 2}\n",
      "{'chem.name': 'nsc-361605', 'cell_name': 'K562', 'avg(distance)': 0.10818138051045034, 'count(distance)': 2}\n",
      "{'chem.name': 'nsc-361605', 'cell_name': 'KM12', 'avg(distance)': 0.3026107281823278, 'count(distance)': 2}\n",
      "{'chem.name': 'nsc-361605', 'cell_name': 'LOX IMVI ', 'avg(distance)': 0.12356875365710707, 'count(distance)': 1}\n",
      "{'chem.name': 'nsc-361605', 'cell_name': 'M14', 'avg(distance)': 0.07335000000000003, 'count(distance)': 2}\n",
      "{'chem.name': 'nsc-361605', 'cell_name': 'MOLT-4', 'avg(distance)': 0.11876514546491324, 'count(distance)': 2}\n",
      "{'chem.name': 'nsc-361605', 'cell_name': 'Malme-3M', 'avg(distance)': 0.12780000000000014, 'count(distance)': 2}\n",
      "{'chem.name': 'nsc-361605', 'cell_name': 'NCI-H226', 'avg(distance)': 0.4641176885346452, 'count(distance)': 2}\n",
      "{'chem.name': 'nsc-361605', 'cell_name': 'NCI-H23', 'avg(distance)': 0.5560499999999999, 'count(distance)': 2}\n",
      "{'chem.name': 'nsc-361605', 'cell_name': 'NCI-H322M', 'avg(distance)': 0.46309999999999985, 'count(distance)': 2}\n",
      "{'chem.name': 'nsc-361605', 'cell_name': 'NCI-H460', 'avg(distance)': 0.5488702214452257, 'count(distance)': 2}\n",
      "{'chem.name': 'nsc-361605', 'cell_name': 'NCI-H522', 'avg(distance)': 0.2786606304079138, 'count(distance)': 2}\n",
      "{'chem.name': 'nsc-361605', 'cell_name': 'OVCAR-3', 'avg(distance)': 0.3267216091954026, 'count(distance)': 1}\n",
      "{'chem.name': 'nsc-361605', 'cell_name': 'OVCAR-4', 'avg(distance)': 0.5461499999999999, 'count(distance)': 2}\n",
      "{'chem.name': 'nsc-361605', 'cell_name': 'OVCAR-5', 'avg(distance)': 0.2782592119866809, 'count(distance)': 2}\n",
      "{'chem.name': 'nsc-361605', 'cell_name': 'OVCAR-8', 'avg(distance)': 0.2006517067711333, 'count(distance)': 2}\n",
      "{'chem.name': 'nsc-361605', 'cell_name': 'RPMI-8226', 'avg(distance)': 0.23919999999999986, 'count(distance)': 2}\n",
      "{'chem.name': 'nsc-361605', 'cell_name': 'RXF 393', 'avg(distance)': 0.36114999999999986, 'count(distance)': 2}\n",
      "{'chem.name': 'nsc-361605', 'cell_name': 'SF-268', 'avg(distance)': 0.11524999999999963, 'count(distance)': 2}\n",
      "{'chem.name': 'nsc-361605', 'cell_name': 'SF-295', 'avg(distance)': 0.18920725490197743, 'count(distance)': 2}\n",
      "{'chem.name': 'nsc-361605', 'cell_name': 'SF-539', 'avg(distance)': 0.29440685679611, 'count(distance)': 2}\n",
      "{'chem.name': 'nsc-361605', 'cell_name': 'SK-MEL-2', 'avg(distance)': 0.5743196149217851, 'count(distance)': 1}\n",
      "{'chem.name': 'nsc-361605', 'cell_name': 'SK-MEL-28', 'avg(distance)': 0.4782937973209038, 'count(distance)': 2}\n",
      "{'chem.name': 'nsc-361605', 'cell_name': 'SK-MEL-5', 'avg(distance)': 0.9469871485943884, 'count(distance)': 1}\n",
      "{'chem.name': 'nsc-361605', 'cell_name': 'SK-OV-3', 'avg(distance)': 0.2539530091185407, 'count(distance)': 2}\n",
      "{'chem.name': 'nsc-361605', 'cell_name': 'SN12C', 'avg(distance)': 0.21522177185870772, 'count(distance)': 2}\n",
      "{'chem.name': 'nsc-361605', 'cell_name': 'SNB-19', 'avg(distance)': 0.3154638904573659, 'count(distance)': 2}\n",
      "{'chem.name': 'nsc-361605', 'cell_name': 'SNB-75', 'avg(distance)': 0.4380274983881378, 'count(distance)': 2}\n",
      "{'chem.name': 'nsc-361605', 'cell_name': 'SR', 'avg(distance)': 0.256537027379395, 'count(distance)': 2}\n",
      "{'chem.name': 'nsc-361605', 'cell_name': 'SW-620', 'avg(distance)': 0.24714999999999998, 'count(distance)': 2}\n",
      "{'chem.name': 'nsc-361605', 'cell_name': 'TK-10', 'avg(distance)': 0.12271689389448825, 'count(distance)': 1}\n",
      "{'chem.name': 'nsc-361605', 'cell_name': 'U-251', 'avg(distance)': 0.05789999999999962, 'count(distance)': 2}\n",
      "{'chem.name': 'nsc-361605', 'cell_name': 'UACC-257', 'avg(distance)': 0.19214999999999982, 'count(distance)': 2}\n",
      "{'chem.name': 'nsc-361605', 'cell_name': 'UACC-62', 'avg(distance)': 0.12335000000000029, 'count(distance)': 2}\n",
      "{'chem.name': 'nsc-361605', 'cell_name': 'UO-31', 'avg(distance)': 0.36709605785593613, 'count(distance)': 2}\n"
     ]
    }
   ],
   "source": [
    "response = graph.run(\n",
    "    \"\"\"\n",
    "    MATCH (org_chem:Synonym {pubChemSynId: \"176dde90cc9dd83eed129de11b203b03\"})\n",
    "    MATCH (gi50:Measurement {name: \"GI50\"})\n",
    "\n",
    "    MATCH (cell:CellLine)<-[:USES]-(c:Condition)-[:USES]->(org_chem)\n",
    "    MATCH (c)-[m:MEASURES]->(gi50)\n",
    "    WITH DISTINCT cell, avg(toFloat(m.value)) as values1, org_chem, gi50\n",
    "\n",
    "    CALL {\n",
    "        WITH cell, gi50, values1\n",
    "        MATCH (chem:Synonym)\n",
    "        WHERE chem.pubChemSynId IN [\"69a8b92463c0467140242a249aa58b2b\"] //, \"ecb8cd2425f4430ce611e50153f09dcc\"]\n",
    "        MATCH (cell)<-[:USES]-(c:Condition)-[:USES]->(chem)\n",
    "        MATCH (c)-[m2:MEASURES]->(gi50)\n",
    "        RETURN DISTINCT cell as cell2, abs(toFloat(m2.value) - values1) as distance,  chem\n",
    "    }\n",
    "\n",
    "    RETURN DISTINCT chem.name, cell2.label as cell_name, avg(distance), count(distance)\n",
    "    ORDER BY cell_name\n",
    "    \"\"\"\n",
    ").data()\n",
    "for r in response:\n",
    "    print(r)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'chem.name': 'nsc-361605', 'avg_dist': 0.34530195673664926, 'num_cell': 91}\n",
      "{'chem.name': 'nsc-684405', 'avg_dist': 0.3656233743457906, 'num_cell': 111}\n",
      "{'chem.name': 'nsc628537', 'avg_dist': 0.3781293960020346, 'num_cell': 46}\n",
      "{'chem.name': 'nsc-785594', 'avg_dist': 0.3838617706291631, 'num_cell': 103}\n",
      "{'chem.name': 'nsc-613493', 'avg_dist': 0.39945509628924536, 'num_cell': 91}\n"
     ]
    }
   ],
   "source": [
    "response = graph.run(\n",
    "    \"\"\"\n",
    "MATCH (org_chem:Synonym {pubChemSynId: \"176dde90cc9dd83eed129de11b203b03\"})\n",
    "MATCH (gi50:Measurement {name: \"GI50\"})\n",
    "\n",
    "MATCH (cell:CellLine)<-[:USES]-(c:Condition)-[:USES]->(org_chem)\n",
    "MATCH (c)-[m:MEASURES]->(gi50)\n",
    "WITH DISTINCT cell, avg(toFloat(m.value)) as values1, org_chem, gi50\n",
    "\n",
    "CALL {\n",
    "    WITH cell, gi50, values1\n",
    "    MATCH (cell)<-[:USES]-(c:Condition)-[:USES]->(chem:Synonym)\n",
    "    MATCH (c)-[m2:MEASURES]->(gi50)\n",
    "    RETURN DISTINCT cell as cell2, abs(toFloat(m2.value) - values1) as distance,  chem\n",
    "}\n",
    "\n",
    "RETURN DISTINCT chem.name, avg(distance) as avg_dist, count(distance) as num_cell ORDER BY avg_dist limit 5\n",
    "    \"\"\"\n",
    ").data()\n",
    "for r in response:\n",
    "    print(r)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 46,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'chem.name': 'nsc19893', 'avg_dist': 3.351961022292937e-15, 'num_cell': 73, 'chem.pubChemSynId': '176dde90cc9dd83eed129de11b203b03'}\n",
      "{'chem.name': 'nsc-684405', 'avg_dist': 0.30413082478114195, 'num_cell': 59, 'chem.pubChemSynId': 'd40f551fe1c9b0833b916e89b01e386d'}\n",
      "{'chem.name': 'nsc-361605', 'avg_dist': 0.31986023473182124, 'num_cell': 48, 'chem.pubChemSynId': '69a8b92463c0467140242a249aa58b2b'}\n",
      "{'chem.name': 'nsc-628083', 'avg_dist': 0.33290434655834006, 'num_cell': 59, 'chem.pubChemSynId': '21e870c91aa63e4e31350aba9c225547'}\n",
      "{'chem.name': 'nsc-618093', 'avg_dist': 0.34773573490256054, 'num_cell': 59, 'chem.pubChemSynId': '08de420218365f71db7c240b9b130523'}\n",
      "{'chem.name': 'nsc-613493', 'avg_dist': 0.35006572711758455, 'num_cell': 49, 'chem.pubChemSynId': 'd20214197486f740ddd9212b5d4cb8e3'}\n",
      "{'chem.name': 'nsc628537', 'avg_dist': 0.3772233298450033, 'num_cell': 45, 'chem.pubChemSynId': 'f38f562a8df970d0fa2419a0cc7d229b'}\n",
      "{'chem.name': 'nsc-785594', 'avg_dist': 0.3796167720061503, 'num_cell': 59, 'chem.pubChemSynId': 'd98f563670509c5b191aca767ccdf55d'}\n",
      "{'chem.name': 'nsc-628081', 'avg_dist': 0.3897650963173308, 'num_cell': 59, 'chem.pubChemSynId': 'c0a55faad1c7e143efbe5f8372971802'}\n",
      "{'chem.name': 'nsc-710905', 'avg_dist': 0.39922370076467034, 'num_cell': 55, 'chem.pubChemSynId': '8820a12daec6475b0cce8664a0849301'}\n",
      "{'chem.name': 'nsc-625429', 'avg_dist': 0.4004440031716282, 'num_cell': 48, 'chem.pubChemSynId': '30c187a8de84997a02fc1f9eb7eea01b'}\n",
      "{'chem.name': 'nsc-621349', 'avg_dist': 0.4075924911847263, 'num_cell': 44, 'chem.pubChemSynId': '2ca22be9484a30ff28017b9618372938'}\n",
      "{'chem.name': 'nsc-651242', 'avg_dist': 0.41289216854840305, 'num_cell': 45, 'chem.pubChemSynId': 'fdeb209568d1732130d52df2f5074fea'}\n",
      "{'chem.name': 'nsc-624425', 'avg_dist': 0.4140202228771283, 'num_cell': 38, 'chem.pubChemSynId': '32500a89afd8ea9c8712ad20167ef502'}\n",
      "{'chem.name': 'nsc7833', 'avg_dist': 0.420691262814509, 'num_cell': 45, 'chem.pubChemSynId': '61c942249509f8d66510c7807d8efcfd'}\n",
      "{'chem.name': 'nsc-318800', 'avg_dist': 0.4212977120971919, 'num_cell': 59, 'chem.pubChemSynId': '9080bc657ec425c415a1918cf65abfc6'}\n",
      "{'chem.name': 'nsc-671119', 'avg_dist': 0.4218865333754301, 'num_cell': 53, 'chem.pubChemSynId': '3543d54a5d698bf18810ac3cf64626e6'}\n",
      "{'chem.name': 'nsc-681451', 'avg_dist': 0.42280714102024813, 'num_cell': 59, 'chem.pubChemSynId': 'c16d598986c436078457de557371eec7'}\n",
      "{'chem.name': 'nsc633526', 'avg_dist': 0.4230390846067495, 'num_cell': 34, 'chem.pubChemSynId': 'b314e3319c74f2fe06991802a6c32832'}\n",
      "{'chem.name': 'nsc 373980', 'avg_dist': 0.42323136653232835, 'num_cell': 58, 'chem.pubChemSynId': 'b67052a9d39dba383c94703918531c10'}\n",
      "{'chem.name': 'nsc-625425', 'avg_dist': 0.42470971884970227, 'num_cell': 48, 'chem.pubChemSynId': '0eee83f00619ec313d34856ec71f3cd7'}\n",
      "{'chem.name': 'nsc-633101', 'avg_dist': 0.42511318724757785, 'num_cell': 34, 'chem.pubChemSynId': 'd471e70f325a62a644d2597eb919278b'}\n",
      "{'chem.name': 'nsc-647556', 'avg_dist': 0.4278529711523801, 'num_cell': 41, 'chem.pubChemSynId': '00dd03d9cf9aa4e68cb802dbf3538e3e'}\n",
      "{'chem.name': 'nsc-630713', 'avg_dist': 0.4280882272160683, 'num_cell': 45, 'chem.pubChemSynId': 'c8573d13d8d516048e58be75f8cf00f5'}\n",
      "{'chem.name': 'nsc-625423', 'avg_dist': 0.42811317352604733, 'num_cell': 48, 'chem.pubChemSynId': '201088a2c9a2cf9548d2a55604d3c2c0'}\n"
     ]
    }
   ],
   "source": [
    "response = graph.run(\n",
    "    \"\"\"\n",
    "    MATCH (org_chem:Synonym {pubChemSynId: \"176dde90cc9dd83eed129de11b203b03\"})\n",
    "    MATCH (the_cell:CellLine {label: \"HCT-15\"})\n",
    "    MATCH (gi50:Measurement {name: \"GI50\"})\n",
    "\n",
    "    MATCH (cell:CellLine)<-[:USES]-(c:Condition)-[:USES]->(org_chem)\n",
    "    WHERE cell <> the_cell\n",
    "    MATCH (c)-[m:MEASURES]->(gi50)\n",
    "    WITH DISTINCT cell, avg(toFloat(m.value)) as values1, org_chem, gi50\n",
    "    CALL {\n",
    "        WITH cell, gi50, values1\n",
    "        MATCH (cell)<-[:USES]-(c:Condition)-[:USES]->(chem:Synonym)\n",
    "        MATCH (c)-[m2:MEASURES]->(gi50)\n",
    "        RETURN DISTINCT cell as cell2, abs(avg(toFloat(m2.value)) - values1) as distance, chem\n",
    "    }\n",
    "\n",
    "    WITH DISTINCT chem, avg(distance) as avg_dist, count(distance) as num_cell \n",
    "    RETURN chem.name, avg_dist, num_cell, chem.pubChemSynId ORDER BY avg_dist limit 25\n",
    "    \"\"\"\n",
    ").data()\n",
    "for r in response:\n",
    "    print(r)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 49,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Avg diff 0.3354599681922921, num difs 60\n",
      "CELL_NAME\n",
      "786-0              0.166140\n",
      "A498               0.242053\n",
      "A549/ATCC          0.544961\n",
      "ACHN               0.028868\n",
      "BT-549             0.022316\n",
      "CAKI-1             1.179450\n",
      "CCRF-CEM           0.399325\n",
      "COLO 205           0.356602\n",
      "DU-145             0.474643\n",
      "EKVX               0.520972\n",
      "HCC-2998           0.044509\n",
      "HCT-116            0.348371\n",
      "HCT-15             0.486082\n",
      "HL-60(TB)          0.323787\n",
      "HOP-62             0.017504\n",
      "HOP-92             0.198874\n",
      "HS 578T            0.505258\n",
      "HT29               0.217601\n",
      "IGROV1             0.379185\n",
      "K-562              0.405421\n",
      "KM12               0.336771\n",
      "LOX IMVI           0.500219\n",
      "M14                0.179045\n",
      "MALME-3M           0.226139\n",
      "MCF7               0.533391\n",
      "MDA-MB-231/ATCC    0.833133\n",
      "MDA-MB-435         0.286708\n",
      "MDA-N              0.092500\n",
      "MOLT-4             0.437065\n",
      "NCI-H226           0.515718\n",
      "NCI-H23            0.267118\n",
      "NCI-H322M          0.321122\n",
      "NCI-H460           0.532160\n",
      "NCI-H522           0.374664\n",
      "NCI/ADR-RES        0.058591\n",
      "OVCAR-3            0.172242\n",
      "OVCAR-4            0.385775\n",
      "OVCAR-5            0.500159\n",
      "OVCAR-8            0.335702\n",
      "PC-3               0.050631\n",
      "RPMI-8226          0.548445\n",
      "RXF 393            0.197537\n",
      "SF-268             0.182881\n",
      "SF-295             0.115482\n",
      "SF-539             0.106257\n",
      "SK-MEL-2           0.574320\n",
      "SK-MEL-28          0.213484\n",
      "SK-MEL-5           0.258127\n",
      "SK-OV-3            0.295503\n",
      "SN12C              0.364982\n",
      "SNB-19             0.110314\n",
      "SNB-75             1.041977\n",
      "SR                 0.584913\n",
      "SW-620             0.373553\n",
      "T-47D              0.064306\n",
      "TK-10              0.122717\n",
      "U251               0.308529\n",
      "UACC-257           0.180156\n",
      "UACC-62            0.303675\n",
      "UO-31              0.379666\n",
      "dtype: float64\n"
     ]
    }
   ],
   "source": [
    "all_diffs_pd = np.abs(correlation[19893] - correlation[628083])\n",
    "print(f\"Avg diff {all_diffs_pd.loc[all_diffs_pd.notna()].mean()}, num difs {sum(all_diffs_pd.notna())}\")\n",
    "print(all_diffs_pd.loc[all_diffs_pd.notna()])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'cell_name': '786-0', 'distance': 0.24530702732849274, 'count(values2)': 1, 'count_cell2': 2}\n",
      "{'cell_name': 'A498', 'distance': 0.9720192862045325, 'count(values2)': 1, 'count_cell2': 1}\n",
      "{'cell_name': 'A549', 'distance': 0.32098122562674547, 'count(values2)': 1, 'count_cell2': 2}\n",
      "{'cell_name': 'ACHN', 'distance': 0.08511766833611834, 'count(values2)': 1, 'count_cell2': 2}\n",
      "{'cell_name': 'CAKI-1', 'distance': 0.7124997108154991, 'count(values2)': 1, 'count_cell2': 1}\n",
      "{'cell_name': 'CCRF-CEM', 'distance': 0.2640000597728651, 'count(values2)': 1, 'count_cell2': 2}\n",
      "{'cell_name': 'COLO 205', 'distance': 0.4936122546270436, 'count(values2)': 1, 'count_cell2': 2}\n",
      "{'cell_name': 'EKVX ', 'distance': 1.5574973776223802, 'count(values2)': 1, 'count_cell2': 2}\n",
      "{'cell_name': 'HCC 2998', 'distance': 0.30879131034482477, 'count(values2)': 1, 'count_cell2': 2}\n",
      "{'cell_name': 'HCT-116', 'distance': 0.1491408890115924, 'count(values2)': 1, 'count_cell2': 2}\n",
      "{'cell_name': 'HCT-15', 'distance': 0.2186523730684451, 'count(values2)': 1, 'count_cell2': 2}\n",
      "{'cell_name': 'HL-60(TB)', 'distance': 0.3298129823413909, 'count(values2)': 1, 'count_cell2': 2}\n",
      "{'cell_name': 'HOP-62', 'distance': 0.13467407621246874, 'count(values2)': 1, 'count_cell2': 2}\n",
      "{'cell_name': 'HT-29', 'distance': 0.09712063492062839, 'count(values2)': 1, 'count_cell2': 2}\n",
      "{'cell_name': 'IGROV-1', 'distance': 0.8354354774156807, 'count(values2)': 1, 'count_cell2': 2}\n",
      "{'cell_name': 'K562', 'distance': 0.1081813805104499, 'count(values2)': 1, 'count_cell2': 2}\n",
      "{'cell_name': 'KM12', 'distance': 0.30261072818232737, 'count(values2)': 1, 'count_cell2': 2}\n",
      "{'cell_name': 'LOX IMVI ', 'distance': 0.12356875365710707, 'count(values2)': 1, 'count_cell2': 1}\n",
      "{'cell_name': 'M14', 'distance': 0.0370613866967302, 'count(values2)': 1, 'count_cell2': 2}\n",
      "{'cell_name': 'MOLT-4', 'distance': 0.11876514546491368, 'count(values2)': 1, 'count_cell2': 2}\n",
      "{'cell_name': 'Malme-3M', 'distance': 0.0430607470511255, 'count(values2)': 1, 'count_cell2': 2}\n",
      "{'cell_name': 'NCI-H226', 'distance': 0.46411768853464563, 'count(values2)': 1, 'count_cell2': 2}\n",
      "{'cell_name': 'NCI-H23', 'distance': 0.35834831649830434, 'count(values2)': 1, 'count_cell2': 2}\n",
      "{'cell_name': 'NCI-H322M', 'distance': 0.21467184750732393, 'count(values2)': 1, 'count_cell2': 2}\n",
      "{'cell_name': 'NCI-H460', 'distance': 0.5488702214452257, 'count(values2)': 1, 'count_cell2': 2}\n",
      "{'cell_name': 'NCI-H522', 'distance': 0.2786606304079138, 'count(values2)': 1, 'count_cell2': 2}\n",
      "{'cell_name': 'OVCAR-3', 'distance': 0.3267216091954026, 'count(values2)': 1, 'count_cell2': 1}\n",
      "{'cell_name': 'OVCAR-4', 'distance': 0.4042749393203957, 'count(values2)': 1, 'count_cell2': 2}\n",
      "{'cell_name': 'OVCAR-5', 'distance': 0.2782592119866809, 'count(values2)': 1, 'count_cell2': 2}\n",
      "{'cell_name': 'OVCAR-8', 'distance': 0.20065170677113375, 'count(values2)': 1, 'count_cell2': 2}\n",
      "{'cell_name': 'RPMI-8226', 'distance': 0.18615478527606566, 'count(values2)': 1, 'count_cell2': 2}\n",
      "{'cell_name': 'RXF 393', 'distance': 0.07113783344178248, 'count(values2)': 1, 'count_cell2': 2}\n",
      "{'cell_name': 'SF-268', 'distance': 0.009150682593862314, 'count(values2)': 1, 'count_cell2': 2}\n",
      "{'cell_name': 'SF-295', 'distance': 0.18920725490197743, 'count(values2)': 1, 'count_cell2': 2}\n",
      "{'cell_name': 'SF-539', 'distance': 0.29440685679611, 'count(values2)': 1, 'count_cell2': 2}\n",
      "{'cell_name': 'SK-MEL-2', 'distance': 0.5743196149217851, 'count(values2)': 1, 'count_cell2': 2}\n",
      "{'cell_name': 'SK-MEL-28', 'distance': 0.4782937973209034, 'count(values2)': 1, 'count_cell2': 2}\n",
      "{'cell_name': 'SK-MEL-5', 'distance': 0.9469871485943884, 'count(values2)': 1, 'count_cell2': 1}\n",
      "{'cell_name': 'SK-OV-3', 'distance': 0.2539530091185407, 'count(values2)': 1, 'count_cell2': 2}\n",
      "{'cell_name': 'SN12C', 'distance': 0.21522177185870817, 'count(values2)': 1, 'count_cell2': 2}\n",
      "{'cell_name': 'SNB-19', 'distance': 0.3154638904573659, 'count(values2)': 1, 'count_cell2': 2}\n",
      "{'cell_name': 'SNB-75', 'distance': 0.43802749838813737, 'count(values2)': 1, 'count_cell2': 2}\n",
      "{'cell_name': 'SR', 'distance': 0.25653702737939454, 'count(values2)': 1, 'count_cell2': 2}\n",
      "{'cell_name': 'SW-620', 'distance': 0.05343703394547017, 'count(values2)': 1, 'count_cell2': 2}\n",
      "{'cell_name': 'TK-10', 'distance': 0.12271689389448825, 'count(values2)': 1, 'count_cell2': 2}\n",
      "{'cell_name': 'U-251', 'distance': 0.01202979433018836, 'count(values2)': 1, 'count_cell2': 2}\n",
      "{'cell_name': 'UACC-257', 'distance': 0.14598090596330504, 'count(values2)': 1, 'count_cell2': 2}\n",
      "{'cell_name': 'UACC-62', 'distance': 0.10933511627906434, 'count(values2)': 1, 'count_cell2': 2}\n",
      "{'cell_name': 'UO-31', 'distance': 0.36709605785593613, 'count(values2)': 1, 'count_cell2': 2}\n"
     ]
    }
   ],
   "source": [
    "response = graph.run(\n",
    "    \"\"\"\n",
    "    MATCH (org_chem:Synonym {pubChemSynId: \"176dde90cc9dd83eed129de11b203b03\"})\n",
    "    MATCH (gi50:Measurement {name: \"GI50\"})\n",
    "\n",
    "    MATCH (cell:CellLine)<-[:USES]-(c:Condition)-[:USES]->(org_chem)\n",
    "    MATCH (c)-[m:MEASURES]->(gi50)\n",
    "    WITH DISTINCT cell, avg(toFloat(m.value)) as values1, org_chem, gi50\n",
    "\n",
    "\n",
    "    MATCH (chem:Synonym)\n",
    "    WHERE chem.pubChemSynId = \"69a8b92463c0467140242a249aa58b2b\"\n",
    "    MATCH (cell)<-[:USES]-(c:Condition)-[:USES]->(chem)\n",
    "    MATCH (c)-[m2:MEASURES]->(gi50)\n",
    "    WITH DISTINCT cell as cell2, avg(toFloat(m2.value)) as values2, chem, values1, count(cell) as count_cell2\n",
    "\n",
    "    RETURN cell2.label as cell_name, avg(abs(values1 - values2)) as distance, count(values2), count_cell2\n",
    "    ORDER BY cell_name\n",
    "    \"\"\"\n",
    ").data()\n",
    "for r in response:\n",
    "    print(r)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.10.3 ('py3_10')",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.3"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "97c55a9bc2d8432a6fab20a50ee29ed5b9bd890255b990ff7fcc839d98cc6ff6"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
