{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# GI50\n",
    "This NCI60 data gives an insight to effect of a chemical on cancer.\n",
    "Cancer is not one disease but a collection of every possible cell in your body growing uncontrolled.\n",
    "For this reason NCI60 has multiple different cell lines (column CELL_NAME).\n",
    "\n",
    "I have here the GI50 data of the NCI60 project\n",
    "GI50: concentration to stop growth with 50%. column \"AVERAGE\" is the average concentration needed."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "from os.path import join as path_join\n",
    "import numpy as np"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(4585048, 14)\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>RELEASE_DATE</th>\n",
       "      <th>EXPID</th>\n",
       "      <th>PREFIX</th>\n",
       "      <th>NSC</th>\n",
       "      <th>CONCENTRATION_UNIT</th>\n",
       "      <th>LOG_HI_CONCENTRATION</th>\n",
       "      <th>PANEL_NUMBER</th>\n",
       "      <th>CELL_NUMBER</th>\n",
       "      <th>PANEL_NAME</th>\n",
       "      <th>CELL_NAME</th>\n",
       "      <th>PANEL_CODE</th>\n",
       "      <th>COUNT</th>\n",
       "      <th>AVERAGE</th>\n",
       "      <th>STDDEV</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>20210223</td>\n",
       "      <td>0001MD02</td>\n",
       "      <td>S</td>\n",
       "      <td>123127</td>\n",
       "      <td>M</td>\n",
       "      <td>-4.6021</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>Non-Small Cell Lung Cancer</td>\n",
       "      <td>NCI-H23</td>\n",
       "      <td>LNS</td>\n",
       "      <td>1</td>\n",
       "      <td>-7.1391</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>20210223</td>\n",
       "      <td>0001MD02</td>\n",
       "      <td>S</td>\n",
       "      <td>123127</td>\n",
       "      <td>M</td>\n",
       "      <td>-4.6021</td>\n",
       "      <td>10</td>\n",
       "      <td>14</td>\n",
       "      <td>Melanoma</td>\n",
       "      <td>M14</td>\n",
       "      <td>MEL</td>\n",
       "      <td>1</td>\n",
       "      <td>-7.0520</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>20210223</td>\n",
       "      <td>0001MD02</td>\n",
       "      <td>S</td>\n",
       "      <td>123127</td>\n",
       "      <td>M</td>\n",
       "      <td>-4.6021</td>\n",
       "      <td>12</td>\n",
       "      <td>5</td>\n",
       "      <td>CNS Cancer</td>\n",
       "      <td>SNB-75</td>\n",
       "      <td>CNS</td>\n",
       "      <td>1</td>\n",
       "      <td>-7.1380</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>20210223</td>\n",
       "      <td>0001MD02</td>\n",
       "      <td>S</td>\n",
       "      <td>123127</td>\n",
       "      <td>M</td>\n",
       "      <td>-4.6021</td>\n",
       "      <td>4</td>\n",
       "      <td>2</td>\n",
       "      <td>Colon Cancer</td>\n",
       "      <td>HCC-2998</td>\n",
       "      <td>COL</td>\n",
       "      <td>1</td>\n",
       "      <td>-6.9426</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>20210223</td>\n",
       "      <td>0001MD02</td>\n",
       "      <td>S</td>\n",
       "      <td>123127</td>\n",
       "      <td>M</td>\n",
       "      <td>-4.6021</td>\n",
       "      <td>5</td>\n",
       "      <td>5</td>\n",
       "      <td>Breast Cancer</td>\n",
       "      <td>MDA-MB-231/ATCC</td>\n",
       "      <td>BRE</td>\n",
       "      <td>1</td>\n",
       "      <td>-6.4485</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   RELEASE_DATE     EXPID PREFIX     NSC CONCENTRATION_UNIT  \\\n",
       "0      20210223  0001MD02      S  123127                  M   \n",
       "1      20210223  0001MD02      S  123127                  M   \n",
       "2      20210223  0001MD02      S  123127                  M   \n",
       "3      20210223  0001MD02      S  123127                  M   \n",
       "4      20210223  0001MD02      S  123127                  M   \n",
       "\n",
       "   LOG_HI_CONCENTRATION  PANEL_NUMBER  CELL_NUMBER  \\\n",
       "0               -4.6021             1            1   \n",
       "1               -4.6021            10           14   \n",
       "2               -4.6021            12            5   \n",
       "3               -4.6021             4            2   \n",
       "4               -4.6021             5            5   \n",
       "\n",
       "                   PANEL_NAME        CELL_NAME PANEL_CODE  COUNT  AVERAGE  \\\n",
       "0  Non-Small Cell Lung Cancer          NCI-H23        LNS      1  -7.1391   \n",
       "1                    Melanoma              M14        MEL      1  -7.0520   \n",
       "2                  CNS Cancer           SNB-75        CNS      1  -7.1380   \n",
       "3                Colon Cancer         HCC-2998        COL      1  -6.9426   \n",
       "4               Breast Cancer  MDA-MB-231/ATCC        BRE      1  -6.4485   \n",
       "\n",
       "   STDDEV  \n",
       "0     0.0  \n",
       "1     0.0  \n",
       "2     0.0  \n",
       "3     0.0  \n",
       "4     0.0  "
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "gi50 = pd.read_csv(path_join(\"data\", \"GI50.csv\"))\n",
    "print(gi50.shape)\n",
    "gi50.head()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Creating a pivot table. Where every value is the average GI50 value of the combination cell line (row) and chemical (column)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th>NSC</th>\n",
       "      <th>1</th>\n",
       "      <th>17</th>\n",
       "      <th>26</th>\n",
       "      <th>89</th>\n",
       "      <th>112</th>\n",
       "      <th>171</th>\n",
       "      <th>185</th>\n",
       "      <th>186</th>\n",
       "      <th>196</th>\n",
       "      <th>197</th>\n",
       "      <th>...</th>\n",
       "      <th>836824</th>\n",
       "      <th>836941</th>\n",
       "      <th>836942</th>\n",
       "      <th>837081</th>\n",
       "      <th>837082</th>\n",
       "      <th>837396</th>\n",
       "      <th>837397</th>\n",
       "      <th>837398</th>\n",
       "      <th>837892</th>\n",
       "      <th>837893</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>CELL_NAME</th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>786-0</th>\n",
       "      <td>-4.716867</td>\n",
       "      <td>-5.557233</td>\n",
       "      <td>-5.4265</td>\n",
       "      <td>-4.70005</td>\n",
       "      <td>-6.4911</td>\n",
       "      <td>-4.0</td>\n",
       "      <td>-7.4287</td>\n",
       "      <td>-4.609967</td>\n",
       "      <td>-5.1022</td>\n",
       "      <td>-5.5461</td>\n",
       "      <td>...</td>\n",
       "      <td>-5.4324</td>\n",
       "      <td>-5.3468</td>\n",
       "      <td>-4.0</td>\n",
       "      <td>-4.8286</td>\n",
       "      <td>-5.1042</td>\n",
       "      <td>-6.6969</td>\n",
       "      <td>-5.5047</td>\n",
       "      <td>-6.5669</td>\n",
       "      <td>-4.301</td>\n",
       "      <td>-5.6072</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>A-172/H.Fine</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>-4.230500</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>A-204</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>A-C/EBP 3</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>A-CREB 1</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>5 rows × 56685 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "NSC             1         17      26       89      112     171     185     \\\n",
       "CELL_NAME                                                                   \n",
       "786-0        -4.716867 -5.557233 -5.4265 -4.70005 -6.4911    -4.0 -7.4287   \n",
       "A-172/H.Fine       NaN       NaN     NaN      NaN     NaN     NaN     NaN   \n",
       "A-204              NaN       NaN     NaN      NaN     NaN     NaN     NaN   \n",
       "A-C/EBP 3          NaN       NaN     NaN      NaN     NaN     NaN     NaN   \n",
       "A-CREB 1           NaN       NaN     NaN      NaN     NaN     NaN     NaN   \n",
       "\n",
       "NSC             186     196     197     ...  836824  836941  836942  837081  \\\n",
       "CELL_NAME                               ...                                   \n",
       "786-0        -4.609967 -5.1022 -5.5461  ... -5.4324 -5.3468    -4.0 -4.8286   \n",
       "A-172/H.Fine -4.230500     NaN     NaN  ...     NaN     NaN     NaN     NaN   \n",
       "A-204              NaN     NaN     NaN  ...     NaN     NaN     NaN     NaN   \n",
       "A-C/EBP 3          NaN     NaN     NaN  ...     NaN     NaN     NaN     NaN   \n",
       "A-CREB 1           NaN     NaN     NaN  ...     NaN     NaN     NaN     NaN   \n",
       "\n",
       "NSC           837082  837396  837397  837398  837892  837893  \n",
       "CELL_NAME                                                     \n",
       "786-0        -5.1042 -6.6969 -5.5047 -6.5669  -4.301 -5.6072  \n",
       "A-172/H.Fine     NaN     NaN     NaN     NaN     NaN     NaN  \n",
       "A-204            NaN     NaN     NaN     NaN     NaN     NaN  \n",
       "A-C/EBP 3        NaN     NaN     NaN     NaN     NaN     NaN  \n",
       "A-CREB 1         NaN     NaN     NaN     NaN     NaN     NaN  \n",
       "\n",
       "[5 rows x 56685 columns]"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "correlation = pd.pivot_table(gi50, values='AVERAGE', index=['NSC'],\n",
    "                    columns=['CELL_NAME'], aggfunc=np.mean)\n",
    "correlation.head()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "The difference in how 2 cell lines react to the same chemical gives us an idea how similar those 2 cell lines are. If we take the average of all difference between all chemicals they have in common we get a difference score. Where 0 means the cells are the same, and infinite means they could not be more different."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Avg diff 0.5365136610125857, num difs 59\n",
      "CELL_NAME\n",
      "786-0              0.071407\n",
      "A498               0.429719\n",
      "A549/ATCC          1.584981\n",
      "ACHN               0.460768\n",
      "BT-549             0.398016\n",
      "CAKI-1             0.784300\n",
      "CCRF-CEM           0.176300\n",
      "COLO 205           0.575962\n",
      "DU-145             0.410943\n",
      "EKVX               0.539297\n",
      "HCC-2998           1.080709\n",
      "HCT-116            0.805091\n",
      "HCT-15             1.106202\n",
      "HL-60(TB)          0.396537\n",
      "HOP-62             0.417476\n",
      "HOP-92             0.198874\n",
      "HS 578T            0.345624\n",
      "HT29               0.930421\n",
      "IGROV1             0.850885\n",
      "K-562              0.288681\n",
      "KM12               0.353211\n",
      "LOX IMVI           0.884969\n",
      "M14                0.006811\n",
      "MALME-3M           0.309639\n",
      "MCF7               0.976516\n",
      "MDA-MB-231/ATCC    1.117000\n",
      "MDA-MB-435         0.491341\n",
      "MDA-N              0.492866\n",
      "MOLT-4             0.432465\n",
      "NCI-H226           0.634068\n",
      "NCI-H23            0.884898\n",
      "NCI-H322M          0.577172\n",
      "NCI-H460           1.474320\n",
      "NCI-H522           0.430789\n",
      "NCI/ADR-RES        0.106971\n",
      "OVCAR-3            0.322022\n",
      "OVCAR-4            0.142525\n",
      "OVCAR-5            0.232159\n",
      "OVCAR-8            0.680952\n",
      "PC-3               0.320669\n",
      "RPMI-8226          0.386245\n",
      "RXF 393            0.087688\n",
      "SF-268             0.176401\n",
      "SF-295             0.113843\n",
      "SF-539             1.292657\n",
      "SK-MEL-2           1.450220\n",
      "SK-MEL-28          0.322956\n",
      "SK-MEL-5           0.505987\n",
      "SK-OV-3            0.234553\n",
      "SN12C              0.237522\n",
      "SNB-19             0.056714\n",
      "SNB-75             0.303177\n",
      "SW-620             0.562713\n",
      "T-47D              0.514094\n",
      "TK-10              0.762917\n",
      "U251               0.075671\n",
      "UACC-257           0.493631\n",
      "UACC-62            0.514315\n",
      "UO-31              0.839446\n",
      "dtype: float64\n"
     ]
    }
   ],
   "source": [
    "np.abs(correlation[\"HCT-15\"] - correlation[\"HOP-92\"]).mean()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "We can do the same in a graph database. However the database is not fully in memory. So first we need to retrieve the data from the corresponding cells"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "import json\n",
    "\n",
    "from py2neo import Graph\n",
    "\n",
    "with open(\"config.json\") as f:\n",
    "    config = json.load(f)\n",
    "\n",
    "neo4j_url = config.get(\"neo4jUrl\", \"bolt://localhost:7687\")\n",
    "user = config.get(\"user\", \"neo4j\")\n",
    "pswd = config.get(\"pswd\", \"password\")\n",
    "graph = Graph(neo4j_url, auth=(user, pswd))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "At this point in the database only hold GI50 data, but we still write the query like more kinds of data exists. We look for all chemicals that have both a condition with cell A and cell B. All conditions also most have GI50 measurement.\n",
    "Next up we average the measurements and calculate the distance just like above.\n",
    "The values do differ a bit from each other because not all chemicals could be loaded into the database."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0.31269519410755936\n"
     ]
    }
   ],
   "source": [
    "response = graph.run(\n",
    "    \"\"\"\n",
    "    MATCH (cell1:CellLine {label: $cell_name_1})\n",
    "    MATCH (gi50:Measurement {name: \"GI50\"})\n",
    "\n",
    "    MATCH (chem:Synonym)<-[:USES]-(c1:Condition)-[:USES]->(cell1)\n",
    "    MATCH (c1)-[m1:MEASURES]->(gi50)\n",
    "    WITH DISTINCT chem as chem, avg(toFloat(m1.value)) as values1, count(m1.value) as numVal1, gi50\n",
    "\n",
    "    MATCH (cell2:CellLine {label: $cell_name_2})\n",
    "    MATCH (chem)<-[:USES]-(c:Condition)-[:USES]->(cell2)\n",
    "    MATCH (c)-[m:MEASURES]->(gi50)\n",
    "    WITH DISTINCT chem as chem, avg(toFloat(m.value)) as values2, count(m.value) as numVal2, values1, numVal1\n",
    "\n",
    "    RETURN avg(abs(values1- values2)) as distance\n",
    "    \"\"\",\n",
    "    cell_name_1=\"HCT-15\",\n",
    "    cell_name_2=\"HOP-92\",\n",
    ").data()\n",
    "print(response[0][\"distance\"])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "HOP-92 0.31269519410755936\n",
      "HCT-116 0.1841500216693871\n"
     ]
    }
   ],
   "source": [
    "response = graph.run(\n",
    "    \"\"\"\n",
    "    MATCH (cell1:CellLine {label: $cell_name_1})\n",
    "    MATCH (gi50:Measurement {name: \"GI50\"})\n",
    "\n",
    "    MATCH (chem:Synonym)<-[:USES]-(c1:Condition)-[:USES]->(cell1)\n",
    "    MATCH (c1)-[m1:MEASURES]->(gi50)\n",
    "    WITH DISTINCT chem as chem, avg(toFloat(m1.value)) as values1, gi50\n",
    "    // WITH DISTINCT cell1, collect(chem) as col_chem, collect(values1) as col_val1, gi50\n",
    "\n",
    "    MATCH (cell2:CellLine)\n",
    "    WHERE cell2.label in [\"HOP-92\", \"HCT-116\"]\n",
    "\n",
    "    MATCH (chem)<-[:USES]-(c:Condition)-[:USES]->(cell2)\n",
    "    MATCH (c)-[m:MEASURES]->(gi50)\n",
    "    WITH DISTINCT chem, avg(toFloat(m.value)) as values2, cell2, values1\n",
    "\n",
    "    RETURN DISTINCT cell2, avg(abs(values1- values2)) as distance\n",
    "    \"\"\",\n",
    "    cell_name_1=\"HCT-15\",\n",
    ").data()\n",
    "\n",
    "for r in response:\n",
    "    print(r[\"cell2\"][\"label\"], r[\"distance\"])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "HOP-92 0.31269519410755936 45469\n",
      "HCT-116 0.1841500216693871 50975\n"
     ]
    }
   ],
   "source": [
    "response = graph.run(\n",
    "    \"\"\"\n",
    "    MATCH (cell1:CellLine {label: $cell_name_1})\n",
    "    MATCH (gi50:Measurement {name: \"GI50\"})\n",
    "\n",
    "    MATCH (chem:Synonym)<-[:USES]-(c1:Condition)-[:USES]->(cell1)\n",
    "    MATCH (c1)-[m1:MEASURES]->(gi50)\n",
    "    WITH DISTINCT chem as chem, avg(toFloat(m1.value)) as values1, gi50\n",
    "\n",
    "    MATCH (cell2:CellLine)\n",
    "    WHERE cell2.label in [\"HOP-92\", \"HCT-116\"]\n",
    "\n",
    "\n",
    "    CALL {\n",
    "        WITH chem, values1, gi50, cell2\n",
    "\n",
    "        MATCH (chem)<-[:USES]-(c:Condition)-[:USES]->(cell2)\n",
    "        MATCH (c)-[m:MEASURES]->(gi50)\n",
    "        WITH DISTINCT chem as chem2, abs(values1-avg(toFloat(m.value))) as values2, cell2 as cell\n",
    "        RETURN chem2, cell, values2\n",
    "    }\n",
    "\n",
    "    RETURN DISTINCT cell.label as cellName, avg(values2) as distance, count(values2) as numChems\n",
    "     \"\"\",\n",
    "    cell_name_1=\"HCT-15\",\n",
    ").data()\n",
    "\n",
    "for r in response:\n",
    "    print(r[\"cellName\"], r[\"distance\"], r[\"numChems\"])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Difference with 786-0 is 0.2012 of 52098 samples\n",
      "Difference with A-172/H.Fine is 0.5092 of 783 samples\n",
      "Difference with A-204 is 1.4629 of 16 samples\n",
      "Difference with A-C/EBP 3 is 0.8016 of 10 samples\n",
      "Difference with A-CREB 1 is 0.8027 of 10 samples\n",
      "Difference with A-CREB 2 is 0.6198 of 10 samples\n",
      "Difference with A-FOS 2 is 0.9863 of 10 samples\n",
      "Difference with A-FOS 3 is 0.8214 of 10 samples\n",
      "Difference with A-JUN 1 is 0.4059 of 10 samples\n",
      "Difference with A-JUN 3 is 0.3378 of 10 samples\n",
      "Difference with A431 is 0.8911 of 10 samples\n",
      "Difference with A498 is 0.2961 of 46660 samples\n",
      "Difference with A549/ATCC is 0.2128 of 53286 samples\n",
      "Difference with ACHN is 0.1831 of 52442 samples\n",
      "Difference with BT-549 is 0.2632 of 37355 samples\n",
      "Difference with CACO-2 is 1.0474 of 17 samples\n",
      "Difference with CAKI-1 is 0.2103 of 49761 samples\n",
      "Difference with CALU-1 is 0.5601 of 16 samples\n",
      "Difference with CCD-19LU is 1.0922 of 3 samples\n",
      "Difference with CCRF-CEM is 0.2796 of 50167 samples\n",
      "Difference with CHA-59 is 0.6397 of 15 samples\n",
      "Difference with CHO is 0.4749 of 2 samples\n",
      "Difference with CHO/159-1 is 0.7652 of 2 samples\n",
      "Difference with COLO 205 is 0.2062 of 52372 samples\n",
      "Difference with COLO 741 is 0.3127 of 36 samples\n",
      "Difference with COLO 746 is 0.8567 of 35 samples\n",
      "Difference with CXF 264L is 0.5797 of 35 samples\n",
      "Difference with DB is 0.5779 of 37 samples\n",
      "Difference with DLD-1 is 0.1242 of 13495 samples\n",
      "Difference with DMS 114 is 0.1897 of 13770 samples\n",
      "Difference with DMS 273 is 0.1597 of 12933 samples\n",
      "Difference with DU-145 is 0.2370 of 40432 samples\n",
      "Difference with EKVX is 0.2419 of 50207 samples\n",
      "Difference with ES-2 CNCR is 0.8899 of 17 samples\n",
      "Difference with H1299p53RE29 is 0.4607 of 24 samples\n",
      "Difference with HCC-2998 is 0.2289 of 48069 samples\n",
      "Difference with HCT-116 is 0.1864 of 52575 samples\n",
      "Difference with HCT-116/CMV-1 is 0.6177 of 22 samples\n",
      "Difference with HCT-116/CMV-2 is 0.6111 of 23 samples\n",
      "Difference with HCT-116/E6-1 is 0.6923 of 23 samples\n",
      "Difference with HCT-116/E6-2 is 0.5909 of 17 samples\n",
      "Difference with HCT-116/P is 0.6159 of 23 samples\n",
      "Difference with HCT-116/P21/A is 0.7844 of 23 samples\n",
      "Difference with HCT-116/P21/B is 0.7885 of 23 samples\n",
      "Difference with HCT-116/P21/C is 0.9059 of 21 samples\n",
      "Difference with HCT-116/PV is 0.7643 of 22 samples\n",
      "Difference with HCT-15 is 0.0000 of 54529 samples\n",
      "Difference with HL-60(TB) is 0.2902 of 48103 samples\n",
      "Difference with HOP-18 is 0.2951 of 10803 samples\n",
      "Difference with HOP-62 is 0.2455 of 51504 samples\n",
      "Difference with HOP-92 is 0.3137 of 46969 samples\n",
      "Difference with HS 578T is 0.3016 of 38674 samples\n",
      "Difference with HT is 0.5987 of 34 samples\n",
      "Difference with HT29 is 0.1896 of 52551 samples\n",
      "Difference with HT29p53RE22 is 1.0519 of 24 samples\n",
      "Difference with IGROV1 is 0.2183 of 52332 samples\n",
      "Difference with JCA-1 is 1.1053 of 17 samples\n",
      "Difference with K-562 is 0.2283 of 51505 samples\n",
      "Difference with KM12 is 0.1913 of 52641 samples\n",
      "Difference with KM20L2 is 0.1601 of 13373 samples\n",
      "Difference with LN-229/H.Fine is 0.5411 of 778 samples\n",
      "Difference with LOX IMVI is 0.1979 of 50462 samples\n",
      "Difference with LXFL 529 is 0.1602 of 12846 samples\n",
      "Difference with LXFS 650L is 0.7371 of 14 samples\n",
      "Difference with M14 is 0.1774 of 52059 samples\n",
      "Difference with M19-MEL is 0.1671 of 14010 samples\n",
      "Difference with MALME-3M is 0.2406 of 49132 samples\n",
      "Difference with MAXF 401 is 0.5023 of 198 samples\n",
      "Difference with MCF7 is 0.2428 of 40794 samples\n",
      "Difference with MCF7-E6 is 0.8909 of 24 samples\n",
      "Difference with MCF7/ATCC is 0.5407 of 17 samples\n",
      "Difference with MDA-MB-231/ATCC is 0.2427 of 40138 samples\n",
      "Difference with MDA-MB-435 is 0.2273 of 40715 samples\n",
      "Difference with MDA-MB-435S is 0.7168 of 3 samples\n",
      "Difference with MDA-MB-468 is 0.4259 of 9632 samples\n",
      "Difference with MDA-N is 0.1803 of 27578 samples\n",
      "Difference with MEXF 514L is 0.4185 of 35 samples\n",
      "Difference with MLI-019 is 1.5788 of 12 samples\n",
      "Difference with MLI-045 is 0.7602 of 16 samples\n",
      "Difference with MLI-059 is 0.9055 of 17 samples\n",
      "Difference with MLI-076 is 0.5898 of 16 samples\n",
      "Difference with MOLT-4 is 0.2628 of 51937 samples\n",
      "Difference with Mar-Bel is 1.4436 of 4 samples\n",
      "Difference with NB4 is 0.1857 of 16 samples\n",
      "Difference with NCI-H226 is 0.2747 of 49400 samples\n",
      "Difference with NCI-H23 is 0.2044 of 52655 samples\n",
      "Difference with NCI-H322M is 0.2509 of 51383 samples\n",
      "Difference with NCI-H460 is 0.2123 of 51814 samples\n",
      "Difference with NCI-H522 is 0.2541 of 48761 samples\n",
      "Difference with NCI/ADR-RES is 0.2098 of 41042 samples\n",
      "Difference with ND-1 is 0.9424 of 17 samples\n",
      "Difference with NYH is 0.6116 of 1 samples\n",
      "Difference with NYH/ICRF-187-1 is 0.5584 of 2 samples\n",
      "Difference with OVCAR-3 is 0.1954 of 51731 samples\n",
      "Difference with OVCAR-4 is 0.2458 of 50726 samples\n",
      "Difference with OVCAR-5 is 0.2600 of 51894 samples\n",
      "Difference with OVCAR-8 is 0.1923 of 53240 samples\n",
      "Difference with P388 is 0.6366 of 1054 samples\n",
      "Difference with P388/ADR is 0.4649 of 1030 samples\n",
      "Difference with PC-3 is 0.2124 of 40507 samples\n",
      "Difference with RKO Waf1 is 0.6932 of 24 samples\n",
      "Difference with RKOp53RE1 is 0.6928 of 24 samples\n",
      "Difference with RL is 1.6581 of 29 samples\n",
      "Difference with RPMI-7951 is 0.8594 of 17 samples\n",
      "Difference with RPMI-8226 is 0.2437 of 49730 samples\n",
      "Difference with RXF 393 is 0.2448 of 47880 samples\n",
      "Difference with RXF 486L is 0.5855 of 17 samples\n",
      "Difference with RXF-631 is 0.1678 of 10434 samples\n",
      "Difference with SF-268 is 0.2216 of 52487 samples\n",
      "Difference with SF-295 is 0.2248 of 52769 samples\n",
      "Difference with SF-539 is 0.2154 of 50154 samples\n",
      "Difference with SF-767 is 1.0836 of 17 samples\n",
      "Difference with SK-BR-3 is 0.5411 of 202 samples\n",
      "Difference with SK-MEL-2 is 0.2371 of 50043 samples\n",
      "Difference with SK-MEL-28 is 0.2374 of 52048 samples\n",
      "Difference with SK-MEL-5 is 0.2117 of 52077 samples\n",
      "Difference with SK-OV-3 is 0.2778 of 50436 samples\n",
      "Difference with SMS-KCNR is 0.7289 of 17 samples\n",
      "Difference with SN12C is 0.1984 of 52738 samples\n",
      "Difference with SN12K1 is 0.3589 of 1072 samples\n",
      "Difference with SNB-19 is 0.2546 of 52389 samples\n",
      "Difference with SNB-75 is 0.3069 of 49341 samples\n",
      "Difference with SNB-78 is 0.2092 of 12970 samples\n",
      "Difference with SR is 0.3116 of 44221 samples\n",
      "Difference with SW 1088 is 0.8043 of 17 samples\n",
      "Difference with SW 1783 is 1.3891 of 11 samples\n",
      "Difference with SW-156 is 0.3537 of 37 samples\n",
      "Difference with SW-1573 is 0.4411 of 36 samples\n",
      "Difference with SW-620 is 0.1713 of 53219 samples\n",
      "Difference with T-47D is 0.3025 of 38420 samples\n",
      "Difference with T47D ERE4 is 0.8753 of 23 samples\n",
      "Difference with T47D FOS1 is 0.8258 of 24 samples\n",
      "Difference with T47D NFkB15 is 0.9034 of 24 samples\n",
      "Difference with T98G/H.Fine is 0.5216 of 780 samples\n",
      "Difference with TE85 is 0.9588 of 4 samples\n",
      "Difference with TK-10 is 0.2606 of 51357 samples\n",
      "Difference with TK-164 is 0.4584 of 35 samples\n",
      "Difference with TSU-PRI is 0.8619 of 18 samples\n",
      "Difference with U-251/H.Fine is 0.5404 of 784 samples\n",
      "Difference with U-373/H.Fine is 0.6472 of 738 samples\n",
      "Difference with U-87/H.Fine is 0.5130 of 783 samples\n",
      "Difference with U118/H.Fine is 0.5574 of 768 samples\n",
      "Difference with U251 is 0.1987 of 52984 samples\n",
      "Difference with UABLG22 is 0.9334 of 17 samples\n",
      "Difference with UABMEL3 is 0.7661 of 17 samples\n",
      "Difference with UACC-257 is 0.2466 of 52176 samples\n",
      "Difference with UACC-62 is 0.2058 of 52010 samples\n",
      "Difference with UISO-BCA-1 is 0.4389 of 36 samples\n",
      "Difference with UO-31 is 0.2162 of 52268 samples\n",
      "Difference with UOK-57 is 0.9829 of 17 samples\n",
      "Difference with VDSO/CMV-8 is 0.9636 of 2 samples\n",
      "Difference with VDSO/CMV-9 is 0.9422 of 3 samples\n",
      "Difference with VDSO/E6-18 is 1.0129 of 2 samples\n",
      "Difference with VDSO/E6-19 is 0.5517 of 3 samples\n",
      "Difference with VDSO/P is 0.8605 of 4 samples\n",
      "Difference with WI-38 is 0.8153 of 4 samples\n",
      "Difference with XF 498 is 0.2395 of 11377 samples\n",
      "Difference with ZR-75-1 is 0.7784 of 17 samples\n",
      "Difference with ZR-75-30 is 0.8847 of 9 samples\n"
     ]
    }
   ],
   "source": [
    "for cell_line in correlation:   \n",
    "    all_distance = np.abs(correlation[\"HCT-15\"] - correlation[cell_line]).dropna()\n",
    "    distance = all_distance.mean()\n",
    "    print(f\"Difference with {cell_line} is {distance:.4f} of {len(all_distance)} samples\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "5819308"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "correlation.isna().sum().sum()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "0.6456632510125747"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "correlation.isna().sum().sum()/correlation.size"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "CELL_NAME\n",
       "A549/ATCC          1394\n",
       "OVCAR-8            1519\n",
       "SW-620             1522\n",
       "U251               1823\n",
       "SF-295             1954\n",
       "                  ...  \n",
       "VDSO/CMV-8        56683\n",
       "VDSO/E6-18        56683\n",
       "NYH/ICRF-187-1    56683\n",
       "CHO               56683\n",
       "NYH               56684\n",
       "Length: 159, dtype: int64"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "correlation.isna().sum().sort_values()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.10.3 ('py3_10')",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.3"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "97c55a9bc2d8432a6fab20a50ee29ed5b9bd890255b990ff7fcc839d98cc6ff6"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
